/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 12:47:08 by igbocha3          #+#    #+#             */
/*   Updated: 2022/02/08 06:57:35 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Конвертирует строку, на которую указывает параметр 'str' в величину
// типа 'int'. Возвращает '0' если строка содержит некорректную запись
// целого числа. Число может завершаться любым символом, пробелами или
// знаками пунктуации.

#include "libft.h"

int	ft_atoi(const char *str)
{
	int	res;
	int	sign;
	int	i;

	res = 0;
	sign = 1;
	i = 0;
	while (str[i] == ' ' || str[i] == '\n' || str[i] == '\t' \
	|| str[i] == '\f' || str[i] == '\r' || str[i] == '\v')
		i++;
	if (str[i] == '-' || str[i] == '+')
		sign = 1 - 2 * (str[i++] == '-');
	while (ft_isdigit(str[i]))
	{
		if (res >= 2147483647)
		{
			if (sign == 1)
				return (2147483647);
			else
				return (-2147483647);
		}
		res = res * 10 + (str[i++] - '0');
	}
	return (sign * res);
}
