/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 12:26:59 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/20 22:55:49 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Устанавливает первые 'n' байтов области начинающейся с 's' в нули
// (пустые байты). Нет возвращаемых значений.  

#include "libft.h"

void	ft_bzero(void *s, size_t n)
{
	ft_memset(s, '\0', n);
}
