/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 10:06:24 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/20 22:57:37 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Функция проверяет, является ли аргумент 'c' типа 'int' буквой или цифрой.
// Возвращает '0' если аргумент не является цифрой или
// буквой и ненулевое значение в противном случае.

#include "libft.h"

int	ft_isalnum(int c)
{
	return (ft_isalpha(c) || ft_isdigit(c));
}
