/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 12:28:03 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/20 23:00:25 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Ищет вхождение в массив символа 'c', сравнивая каждый байт массива
// определенный как 'unsigned char' с кодом искомого символа. Если искомый
// символ найден, то возвращается адрес найденного символа и сравнение
// завершается. Если, после проверки 'n' байтов, искомый символ не
// найден, то сравнение прекращается и функция возвращает 'NULL'.

#include "libft.h"

void	*ft_memchr(const void *s, int c, size_t n)
{
	unsigned char	*ptr;
	size_t			i;

	i = 0;
	ptr = (unsigned char *)s;
	while (i < n)
	{
		if (ptr[i] == (unsigned char)c)
			return (&ptr[i]);
		i++;
	}
	return (NULL);
}
