/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memccpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/14 18:55:19 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/20 22:59:40 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Копирует содержимое области памяти, на которую указывает 'src', в область
// памяти, на которую указывает 'dst'. Копирование заканчивается, когда
// скопи­ровано 'n' байт или после копирования первого вхождения символа 'c'.
// Возвращает указатель на конец области 'dst', если
// символ 'c' был найден, или 'NULL', если 'c' не входит в 'source'.

#include "libft.h"

void	*ft_memccpy(void *dst, const void *src, int c, size_t n)
{
	const char	*tmp_src;
	char		*tmp_dst;
	char		chr;
	size_t		i;

	if (!dst && !src)
		return (dst);
	tmp_src = src;
	tmp_dst = dst;
	chr = c;
	i = 0;
	while (n > i)
	{
		tmp_dst[i] = tmp_src[i];
		if (tmp_src[i] == chr)
			return (dst + (i + 1));
		i++;
	}
	return (NULL);
}
