/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memset.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/09 16:57:14 by rchallie          #+#    #+#             */
/*   Updated: 2022/01/20 23:03:30 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Копирует байт 'c' в первые 'len' символов массива, на который указывает
// 'buf'. Функция возвращает 'buf'. Чаще всего используется для присвоения
// начальных значений определенной области памяти.

#include "libft.h"

void	*ft_memset(void *buf, int c, size_t len)
{
	size_t	i;
	char	*ptr;

	i = 0;
	ptr = (char *)buf;
	while (len > i)
	{
		ptr[i] = (char)c;
		i++;
	}
	return (buf);
}
