/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/14 10:32:18 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/20 23:03:56 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Выводит символ 'с' в поток вывода файлового дескриптора 'fd'. 

#include "libft.h"

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
