/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/14 10:32:35 by igbocha3          #+#    #+#             */
/*   Updated: 2022/01/21 01:08:18 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Выводит строку 's' в указанный файловый дескриптор, за которым следует
// новая строка.

#include "libft.h"

void	ft_putendl_fd(char *s, int fd)
{
	ft_putstr_fd(s, fd);
	ft_putchar_fd('\n', fd);
}
