/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strmapi.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/14 10:34:34 by igbocha3          #+#    #+#             */
/*   Updated: 2022/02/03 09:00:28 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Применяет функцию 'f' к каждому символу строки 's', и передавая ее индекс в
// качестве первого аргумента, создает новую строку с помощью 'malloc(3)'
// полученную в результате последовательных применений 'f'

#include "libft.h"

char	*ft_strmapi(char const *s, char (*f)(unsigned int, char))
{
	char			*str;
	unsigned int	i;

	i = 0;
	if (!s)
		return (NULL);
	str = ft_strdup(s);
	if (!str || !f)
		return (NULL);
	while (str[i])
	{
		str[i] = f(i, str[i]);
		i++;
	}
	return (str);
}
