/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/02/08 05:26:15 by igbocha3          #+#    #+#             */
/*   Updated: 2022/02/08 11:03:48 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Применяет функцию 'f' к каждому символу строки строке, переданной в качестве
// аргумента, и передавая ее индекс в качестве первого аргумента.  Каждый
// символ передается по адресу 'f' для изменения при необходимости.

#include "libft.h"

void	ft_striteri(char *s, void (*f)(unsigned int, char *))
{
	unsigned int	i;

	i = 0;
	if (s != NULL && f != NULL)
	{
		i = 0;
		while (s[i])
		{
			f(i, s + i);
			i++;
		}
	}
}
