/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlcpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/03 20:32:01 by igbocha3          #+#    #+#             */
/*   Updated: 2022/02/08 06:40:36 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Копирует из строки 'src' в буфер 'dst' не более чем 'dstsize - 1' символов и
// гарантированно устанавливает в конец строки нулевой символ. Возвращает размер
// строки по адресу 'src'.

#include "libft.h"

size_t	ft_strlcpy(char *dst, const char *src, size_t dstsize)
{
	size_t	i;

	i = 0;
	if (dstsize == 0)
	{
		while (src[i])
			i++;
		return (i);
	}
	while (i < dstsize - 1 && src[i] != '\0')
	{
		dst[i] = src[i];
		i++;
	}
	if (i < dstsize)
		dst[i] = '\0';
	while (src[i] != '\0')
		i++;
	return (i);
}
