/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 12:16:04 by igbocha3          #+#    #+#             */
/*   Updated: 2021/12/26 00:18:54 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Преобразует букву верхнего регистра в соответствующую букву нижнего регистра.
// Если аргументом не буква в верхнем регистре, все возвращается без изменений.

#include "libft.h"

int	ft_tolower(int c)
{
	if (c >= 65 && c <= 90)
	{
		return (c + 32);
	}
	return (c);
}
